
[
    {
      "pic": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ8Ox6r4iUsIgNM9S_RLHRsJ6Efk6nyule0RA&usqp=CAU",
      "details": "To help ease the process, we identified 75 of our favorite medical blogs everyone in the field can learn from. Whether you’re pondering medical school, have been a physician for years, or simply want to know how to make well-informed decisions about your health, there’s something on this list for everyone. Keep this list of medical blogs handy and the answers to your medical questions will always be just a few clicks away. we identified 75 of our favorite medical blogs everyone in the field can",
      "name": "Eye Care",
      "charge": "500"
    },
    {
      "pic": "https://lkglaw.net/wp-content/uploads/2019/03/Medical-Treatment.jpg",
      "details": "we identified 75 of our favorite medical blogs everyone in the field can.No matter how much you know about a particular medical field, as a health care professional, you always need to be thinking about what’s next. Thanks to advances in technology, new clinical studies, and ever-changing health care policy, there’s always more to know.",
      "name": "Asthma Tritment",
      "charge": "700"
    },
    {
      "pic": "https://assignmentpoint.com/wp-content/uploads/2016/11/free-medical-treatment.jpg",
      "details": "If you are interested in a wide range of medical topics, these blogs are worth checking out. They’re also great for those who want to be more informed about health, but have difficulty figuring out where to start.we identified 75 of our favorite medical blogs everyone in the field can",
      "name": "Hart Problem",
      "charge": "1000"
    },
    {
      "pic": "https://media.istockphoto.com/photos/healthcare-business-graph-and-medical-examination-and-businessman-pic-id1165046681?b=1&k=20&m=1165046681&s=170667a&w=0&h=Z6FqzstObd186tjQwVAK0JpSNUQFxSmLWoHjL2LZg6w=",
      "details": "The well-known health website has quite a collection of blogs,we identified 75 of our favorite medical blogs everyone in the field can. but WebMD Doctors stands out for how relatable it is. Each post is penned by a physician, and the topics can be about parenting, heart medication, or how even health professionals struggle with healthy eating.",
      "name": "Gastric Alcer",
      "charge": "800"
    },
    {
      "pic": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTu7XkZReKgKUR0CgJkMnxI6YeHC8aoYmUwRA&usqp=CAU",
      "details": "Plenty of medical institutions have blogs, but Cedars-Sinai’s stands out for covering genuinely interesting topics.we identified 75 of our favorite medical blogs everyone in the field can .Instead of numerous posts about their faculty and facilities, expect to read about health topics relevant to just about everyone.",
      "name": "Scabis",
      "charge": "900"
    },
    {
      "pic": "https://prod-media-eng.dhakatribune.com/uploads/2018/07/bigstock-medical-treatment-edited-1531416323370.jpg",
      "details": "This blog is part of Harvard Medical School’s family of publications and manages to answer questions most of us didn’t even think to ask. While topics are hard-hitting,we identified 75 of our favorite medical blogs everyone in the field can. don’t expect to find anything terribly obscure when scrolling through these posts.",
      "name": "Insomnia",
      "charge": "450"
    }
  ]